# 2. Напишите программу, которая на вход принимает 5 чисел и находит максимальное из них.
    
#     Примеры:
    
#     - 1, 4, 8, 7, 5 -> 8
#     - 78, 55, 36, 90, 2 -> 90

# list = []
# for i in range(5):
#     x = int(input("Введите число: "))
#     print(x)


print(max(1, 4, 998, 7, 5))