# Напишите программу, которая найдёт произведение пар чисел списка.
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.
# Пример:
# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]

list_1 = [2, 3, 4, 5, 6]
list1 = []
for i in list_1:
    list1.append(i * list_1.pop())
print(list1)