# 3. Напишите программу, в которой пользователь будет задавать две строки,
# а программа - определять количество вхождений одной строки в другой.

a = input("Введите число A: ")
b = input("Введите число B: ")

print(a.count(b))

